report/todo.org
* FYP Timeline
** DONE Implement rapid ground truth generation
   CLOSED: [2017-03-10 Fri 12:38]
*** DONE using detection free tracking to generate ground truth
    CLOSED: [2017-02-20 Mon 10:22]
*** TODO using object proposal to suggest bounding box
** DONE Implement data augmentation
   CLOSED: [2017-03-10 Fri 12:39]
*** DONE Scale
    CLOSED: [2017-02-20 Mon 10:21]
*** DONE Rotation
    CLOSED: [2017-02-20 Mon 10:22]
*** TODO fancy PCA
*** DONE horizontal flipping
    CLOSED: [2017-02-20 Mon 10:22]
*** TODO random cropping
** DONE Performs pre-processing before training
   CLOSED: [2017-03-10 Fri 12:39]
  [[http://www.kdnuggets.com/2016/03/must-know-tips-deep-learning-part-1.html][KD-Nugget Augmentation]]
  [[http://machinelearningmastery.com/image-augmentation-deep-learning-keras/][Keras Augmentation]]
*** DONE Zero-center and normalize image
    CLOSED: [2017-02-20 Mon 10:22]
    #+BEGIN_SRC python
      X -= np.mean(X, axis = 0) # zero-center
      X /= np.std(X, axis = 0) # normalize
    #+END_SRC
*** DONE [[http://ufldl.stanford.edu/wiki/index.php/Data_Preprocessing][UFDL Stanford Data Preprocessing]]
    CLOSED: [2017-02-20 Mon 10:22]
*** DONE Batch normalization if using deep learning
    CLOSED: [2017-02-20 Mon 10:22]
*** TODO [[https://en.wikipedia.org/wiki/Color_normalization#Comprehensive_Color_Normalization][Color Normalization]]
** DONE Implement validation framework
   CLOSED: [2017-03-10 Fri 12:39]
*** TODO Visualization of tracker's result using [[https://github.com/jinified/TBD-evaluation][TBD-Evaluation]]
*** DONE Using MOT Devkit to validate tracker performance
** Implement object proposals
   [[https://pdollar.wordpress.com/2013/12/22/generating-object-proposals/][PDollar Objectness]]
   [[https://rodrigob.github.io/documents/2014_bmvc_selective_search_with_supplementary_material.pdf][Evaluation of object proposals]]
*** TODO Validate effectiveness of MSER 
*** TODO Implement [[https://arxiv.org/pdf/1511.04511.pdf][BING++]]
*** TODO Implement [[http://web.bii.a-star.edu.sg/~zhangxw/files/EdgeBoxes_ECCV2014.pdf][EdgeBoxes]]
*** TODO Implement [[https://ivi.fnwi.uva.nl/isis/publications/2013/UijlingsIJCV2013/UijlingsIJCV2013.pdf][SelectiveSearch]]
*** TODO Implement [[http://www.shengfenghe.com/uploads/1/5/1/3/15132160/oop_iccv15.pdf][OrientedObjectProposal]]
*** TODO Implement saliency-based objectness, [[http://ivrl.epfl.ch/research/saliency/fast_saliency][FASA]]
** Implement object detection  
*** HOG better at describing shape. Rectangular feature better at shading
*** SIFT captures local interest point and lack contrast normalization
*** CNN learned features is another popular one
*** [[http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.308.1785&rep=rep1&type=pdf][Survey of Moment Invariant]]
*** [[http://www.indjst.org/index.php/indjst/article/viewFile/95209/70254][Choosing moment based function]]
*** [[https://pdfs.semanticscholar.org/5849/88271268671bb7442221a40a17ee909c04e7.pdf][Shape based object recognition]]
*** TODO Implement [[https://vision.cornell.edu/se3/wp-content/uploads/2014/09/dollarBMVC09ChnFtrs_0.pdf][Integral Channel Feature]]
*** TODO Implement [[https://pdfs.semanticscholar.org/4f23/a446f1f15d0ac65e4e50232531f8eb404a7b.pdf][Pedestrian Detection at 100 fps]]
*** TODO Implement [[https://pdollar.github.io/files/papers/DollarPAMI14pyramids.pdf][ACF]]
*** TODO Experment with various descriptors, AKAZE, FAST, SURF
*** TODO Implement [[http://vc.cs.nthu.edu.tw/home/paper/codfiles/hkchiu/201205170946/Histograms%20of%20Oriented%20Gradients%20for%20Human%20Detection.pdf][HOG]]
*** TODO Using [[http://people.cs.uchicago.edu/~pff/papers/lsvm-pami.pdf][DPM]] approach
*** TODO Implement local color histogram
*** TODO Implement Color rectangle
*** TODO Combine local and global features
*** TODO Explore weaker moment based descriptor, Zernike, Hu
** Selecting object representation scheme
*** TODO [[http://web.cs.hacettepe.edu.tr/~pinar/courses/CMP719/lectures/representation.pdf][Windows vs part based]]
*** TODO [[http://eeeweba.ntu.edu.sg/computervision/Research%20Papers/2016/Invariant%20Multi-Scale%20Shape%20Descriptor%20for%20Object%20Matching%20and%20Recognition.pdf][Invariant Multiscale Shapre Descriptor]]
** Implement probabilistic object tracking
*** [[https://arxiv.org/pdf/1603.00831.pdf][MOT2016: Benchmark]]
*** [[https://arxiv.org/pdf/1604.00970.pdf][Extended Object Tracking]]
*** [[http://www.cv-foundation.org/openaccess/content_cvpr_2013/papers/Wu_Online_Object_Tracking_2013_CVPR_paper.pdf][Online Object Tracking A Benchmark]]
*** [[https://arxiv.org/pdf/1409.7618.pdf][Multiple Object Tracking: Literature Review]]
*** TODO Particle Filter
*** TODO Particle Swarm Optimization
*** TODO Nearest-neigbour
*** TODO Camshift
** Implement automatic machine learning    
*** TODO Automatic parameter optimization
*** TODO Automatic algorithm suggestion (Offline)
*** TODO Automatic online preprocessing
** Validate ensemble approach 
*** TODO Bagging
*** TODO Boosting
*** TODO Multiple-algorithm detection
*** TODO Multiple-cue detections
** Implement color transformation methods
*** TODO Illumination-invariant
*** TODO Shadow-invariant
** Implement a way to add prior knowledge to tracker
*** TODO Encoding visual prior using sparse representation
*** TODO Geometric constraints
** Adapt online learning approach
*** TODO [[http://cmp.felk.cvut.cz/~matas/papers/kalal-pn_learning-cvpr10.pdf][P-N Learning]] 
*** TODO [[http://vision.ucsd.edu/~bbabenko/data/miltrack_cvpr09.pdf][Multiple Instance Learning]]
*** TODO [[http://cvgl.stanford.edu/papers/xiang_iccv15.pdf][Tracking by Decision Making]]
** Use detection free tracking technique
*** TODO Correlation-filter
*** TODO TLD
*** TODO [[http://www.vision.ee.ethz.ch/~hegrabne/papers/Stalder2012DynamicObjectnessAdaptive.pdf][Dynamic objectness for Adaptation Tracking]]
*** TODO [[http://www.cv-foundation.org/openaccess/content_cvpr_2015/papers/Possegger_In_Defense_of_2015_CVPR_paper.pdf][In Defense of Color based Model Free Tracking]]
** Apply domain adaptation
*** TODO Implement efficient learning of domain invariant represantation
*** TODO Unsupervised manifold method
*** TODO Dictionary learning: Sparse & Low Rank Models
*** TODO Transfer learning from DNN
*** TODO Unsupervised learning
**** Autoencoders
**** Sparse Coding
**** Clustering
** Improve process of training and testing tracker
*** TODO Active Learning to suggest what kind of data to collect
*** TODO Allow for human intervention to aid in data collection
** Experiment with Gaussian Process & Feature Selection
** Explore unsupervised feature learning
*** TODO RBM
*** TODO Autoencoder
*** TODO CNN

* Objectives
** Robustness
*** Different environment i.e pool, ocean, lake
*** Different illuminations i.e cloudy, bright, shadow
*** Different viewpoint
** Automation
*** Hyperparamters optimization:
**** Preprocessing
**** Object Detection
**** Camera parameters
*** Features selection
*** Model Selection
** Efficiency
*** Low detection latency
*** Decent performance with small amount of data
*** Active learning approach to data collection
** Ease of use
*** Rapid ground truth generation
*** Able to encode prior knowledge easily
*** Ease of human intervention to speedup

* Questions
** Problem with high detection latency
*** Preprocessing & Object Proposals major culprit
*** Convert code to use cython or c++
** Weaknesses of baseline method
*** Rely too much on appearance model using geometric constraints (prior knowledge)
*** Generate binary mask instead of confidence score
** Slow annotation during competition to incorporate data
*** Unsupervised learning or semi-supervised learning approach
*** Transfer learning with data collected from previous years
** Whether automatic machine learning is necessary ?
*** Best method proven for a niche field instead of choosing
*** Using non-parametric method such as Gaussian Process
** Should group detection and tracking together ?
*** Added benefit of saving computation
** Ensemble approach
*** Tend to yield better accuracy but slow. 
*** Consider exploring boosting
** Should consider deep learning approach ?
*** Access to GPU for training
** Recommended features for tracking ?
*** HOG, SURF, Binary Feature Descriptor
** Domain adaptation
*** Using a feature that is invariant to that causes difference in source and target distribution
** Best way to encode shape of the object ?
** Image statistics that can be used to map different type of environment
* Discussion <2017-02-09 Thu>
** Be careful when performing zero mean unit variance
*** Multiply by some constant, standard deviation + constant mean
** Synthesize more data for training. Remember to learn from Robosub condition
*** Uses MMDA to break down to different subspaces to learn invariant representation
** Correlation filter is very fast but not robust against illuminations
** HOG not suitable for object without much edge
